<?php
/**
 * 在当前目录执行 php -S 127.0.0.1:8001后浏览器可以运行 http://127.0.0.1:8001
 */
use asbamboo\helper\env\Env AS EnvHelper;
use asbamboo\openpayAlipay\Env AS AlipayEnv;

/***************************************************************************************************
 * 系统文件加载
 ***************************************************************************************************/
require_once dirname(__DIR__) . '/vendor/autoload.php';
/***************************************************************************************************/

/***************************************************************************************************
 * 参数配置
***************************************************************************************************/
// 支付宝网关
EnvHelper::set(AlipayEnv::ALIPAY_GATEWAY_URI, 'https://openapi.alipaydev.com/gateway.do');
// 自己生成支付宝rsa私银文件
EnvHelper::set(AlipayEnv::ALIPAY_RSA_PRIVATE_KEY, dirname(__DIR__) . '/alipay-rsa/app_private_key.pem');
// 支付宝生成支付宝rsa公银文件
EnvHelper::set(AlipayEnv::ALIPAY_RSA_ALIPAY_KEY, dirname(__DIR__) . '/alipay-rsa/app_alipay_key.pem');
// 支付宝app id
EnvHelper::set(AlipayEnv::ALIPAY_APP_ID, '2016090900468991');
// 支付宝扫码支付的notify url
EnvHelper::set(AlipayEnv::ALIPAY_QRCD_NOTIFY_URL, 'http://example.org');
/***************************************************************************************************/

/***************************************************************************************************
 * 启动openpay引导程序
 ***************************************************************************************************/
require dirname(__DIR__) . '/vendor/asbamboo/openpay/bootstrap.php';
/***************************************************************************************************/